Repository: Murtuzzz/Switch
Catalog: Switch/*.lproj/Localizable.strings
Languages: es, ru

# app_subtitle
source: Logic Puzzle
es: Rompecabezas Lógico
ru: Логическая головоломка

# button_start_game
source: 🎮 Start Game
es: 🎮 Comenzar Juego
ru: 🎮 Начать игру

# button_survival_mode
source: ⚡ Logic Mode
es: ⚡ Modo Lógica
ru: ⚡ Режим Логика

# button_memory_mode
source: 🧠 Memory Mode
es: 🧠 Modo Memoria
ru: 🧠 Режим Память

# button_reaction_mode
source: 🚀 Reaction Mode
es: 🚀 Modo Reacción
ru: 🚀 Режим Реакция

# mode_survival
source: Survival
es: Supervivencia
ru: Выживание

# mode_memory
source: Memory
es: Memoria
ru: Память

# mode_reaction
source: Reaction
es: Reacción
ru: Реакция

# mode_sequence
source: Sequence
es: Secuencia
ru: Последовательность

# mode_pattern
source: Pattern
es: Patrón
ru: Паттерн

source: Level
es: Nivel
ru: Уровень

# level_number
source: Level %d
es: Nivel %d
ru: Уровень %d

# level_survival
source: Survival - Level %d
es: Supervivencia - Nivel %d
ru: Выживание - Уровень %d

# level_logic
source: Logic - Level %d
es: Lógica - Nivel %d
ru: Логика - Уровень %d

# level_reaction
source: Reaction - Level %d
es: Reacción - Nivel %d
ru: Реакция - Уровень %d

# score
source: Score: %d
es: Puntuación: %d
ru: Счет: %d

# time
source: Time: %d
es: Tiempo: %d
ru: Время: %d

# time_seconds
source: Time: %.2f
es: Tiempo: %.2f
ru: Время: %.2f

# time_placeholder
source: Time: --.--
es: Tiempo: --.--
ru: Время: --.--

# record
source: Record: %d
es: Récord: %d
ru: Рекорд: %d

# best_score
source: Best Score: %d
es: Mejor Puntuación: %d
ru: Лучший результат: %d

# set_first_record
source: Set your first record!
es: ¡Establece tu primer récord!
ru: Поставьте свой первый рекорд!

# settings_title
source: Settings
es: Configuración
ru: Настройки

# switch_color_title
source: Switch Color
es: Color del Interruptor
ru: Цвет переключателей

# switch_color_subtitle
source: Choose color for switches
es: Elige el color para los interruptores
ru: Выберите цвет для переключателей

# sound_title
source: Switch Sound
es: Sonido del Interruptor
ru: Звук переключения

# sound_subtitle
source: Sound effect when tapping
es: Efecto de sonido al tocar
ru: Звуковой эффект при нажатии

# sound_classic
source: Classic
es: Clásico
ru: Классический

# sound_electronic
source: Electronic
es: Electrónico
ru: Электронный

# sound_crunch
source: Crunch
es: Crujido
ru: Хруст

# sound_none
source: No Sound
es: Sin Sonido
ru: Без звука

# background_title
source: Level Background
es: Fondo del Nivel
ru: Фон уровней

# background_subtitle
source: Background style for game screens
es: Estilo de fondo para pantallas de juego
ru: Стиль фона для игровых экранов

# background_light
source: Light
es: Claro
ru: Светлый

# background_dark
source: Dark
es: Oscuro
ru: Темный

# background_gradient
source: Gradient
es: Degradado
ru: Градиент

# background_system
source: System
es: Sistema
ru: Системный

# preview_title
source: Preview
es: Vista Previa
ru: Предпросмотр

# preview_subtitle
source: Check switch settings
es: Verificar configuración del interruptor
ru: Проверьте настройки переключателя

# high_scores_title
source: Records
es: Récords
ru: Рекорды

# high_scores_subtitle
source: Your best results
es: Tus mejores resultados
ru: Ваши лучшие результаты

# no_records_survival
source: No records in survival mode yet
es: Aún no hay récords en modo supervivencia
ru: Пока нет рекордов в режиме выживания

# no_records_memory
source: No records in memory mode yet
es: Aún no hay récords en modo memoria
ru: Пока нет рекордов в режиме памяти

# no_records_reaction
source: No records in reaction mode yet
es: Aún no hay récords en modo reacción
ru: Пока нет рекордов в режиме реакции

# no_records_general
source: No records yet
es: Aún no hay récords
ru: Пока нет рекордов

# empty_records_message
source: Play this mode to set a record!
es: ¡Juega este modo para establecer un récord!
ru: Сыграйте в этот режим, чтобы установить рекорд!

source: points
es: puntos
ru: очков

# goal_title
source: Goal
es: Objetivo
ru: Цель

# rules_title
source: Rules
es: Reglas
ru: Правила

# warning_title
source: Warning
es: Advertencia
ru: Внимание

# tip_title
source: Tip
es: Consejo
ru: Совет

# button_start
source: Start Game
es: Comenzar Juego
ru: Начать игру

# button_back
source: Back
es: Atrás
ru: Назад

# survival_mode_title
source: Logic Mode
es: Modo Lógica
ru: Режим Логика

# survival_goal
source: Set the correct switch combination!
es: ¡Establece la combinación correcta de interruptores!
ru: Установите правильную комбинацию переключателей!

# survival_rules
source: • Red circles show target positions • Set switches to correct position • You have 30 seconds per level • Difficulty increases with each level
es: • Los círculos rojos muestran las posiciones objetivo • Configura los interruptores en la posición correcta • Tienes 30 segundos por nivel • La dificultad aumenta con cada nivel
ru: • Красные кружки показывают нужные позиции • Установите переключатели в правильное положение • У вас есть 30 секунд на уровень • Сложность увеличивается с каждым уровнем

# survival_warning
source: Time is limited! Solve the logic puzzle in time
es: ¡El tiempo es limitado! Resuelve el rompecabezas lógico a tiempo
ru: Время ограничено! Успейте решить логическую задачу

# survival_tip
source: Think fast and logically!
es: ¡Piensa rápido y lógicamente!
ru: Думайте быстро и логично!

# memory_mode_title
source: Memory Mode
es: Modo Memoria
ru: Режим Память

# memory_mode_subtitle
source: Memory Mode - endless game
es: Modo Memoria - juego infinito
ru: Режим Память - бесконечная игра

# memory_goal
source: Remember and repeat the sequence!
es: ¡Recuerda y repite la secuencia!
ru: Запомните и повторите последовательность!

# memory_rules
source: • Remember the sequence of highlighted buttons • Repeat it in the same order • Each level adds a new button • Choose mode: Sequence (4 buttons) or Pattern (9 buttons)
es: • Recuerda la secuencia de botones iluminados • Repítela en el mismo orden • Cada nivel agrega un nuevo botón • Elige modo: Secuencia (4 botones) o Patrón (9 botones)
ru: • Запомните последовательность подсвеченных кнопок • Повторите её в том же порядке • Каждый уровень добавляет новую кнопку • Выберите режим: Последовательность (4 кнопки) или Паттерн (9 кнопок)

# memory_warning
source: One mistake = game over
es: Un error = fin del juego
ru: Одна ошибка = конец игры

# memory_tip
source: Train your visual memory and concentration!
es: ¡Entrena tu memoria visual y concentración!
ru: Тренируйте зрительную память и концентрацию!

# reaction_mode_title
source: Reaction Mode
es: Modo Reacción
ru: Режим Реакция

# reaction_goal
source: Quickly tap the highlighted button!
es: ¡Toca rápidamente el botón iluminado!
ru: Быстро нажимайте на подсвеченную кнопку!

# reaction_rules
source: • Blue button lights up randomly • Tap it before time runs out • Time decreases with each level • 7 correct answers = new level
es: • El botón azul se ilumina aleatoriamente • Tócalo antes de que se acabe el tiempo • El tiempo disminuye con cada nivel • 7 respuestas correctas = nuevo nivel
ru: • Синяя кнопка загорается случайно • Нажмите на неё до истечения времени • Время уменьшается с каждым уровнем • 7 правильных ответов = новый уровень

# reaction_warning
source: One mistake or miss = game over
es: Un error o falla = fin del juego
ru: Одна ошибка или пропуск = конец игры

# reaction_tip
source: Be attentive and fast!
es: ¡Sé atento y rápido!
ru: Будьте внимательны и быстры!

# instructions_remember_sequence
source: Remember the sequence
es: Recuerda la secuencia
ru: Запомните последовательность

# instructions_remember_pattern
source: Remember the pattern
es: Recuerda el patrón
ru: Запомните паттерн

# instructions_remember_with_level
source: Remember the %@! Level %d
es: ¡Recuerda la %@! Nivel %d
ru: Запомните %@! Уровень %d

# instructions_your_turn
source: Your turn!
es: ¡Tu turno!
ru: Ваш ход!

# instructions_repeat_sequence
source: Your turn! Repeat the sequence
es: ¡Tu turno! Repite la secuencia
ru: Ваш ход! Повторите последовательность

# instructions_tap_button
source: Tap the highlighted button!
es: ¡Toca el botón iluminado!
ru: Нажмите на подсвеченную кнопку!

# instructions_waiting
source: Waiting for instructions...
es: Esperando instrucciones...
ru: Ожидание инструкций...

source: Correct!
es: ¡Correcto!
ru: Верно!

# incorrect
source: Incorrect! Try again.
es: ¡Incorrecto! Inténtalo de nuevo.
ru: Неверно! Попробуйте снова.

# incorrect_reaction
source: Incorrect! Correct button highlighted in orange
es: ¡Incorrecto! El botón correcto está resaltado en naranja
ru: Неверно! Правильная кнопка подсвечена оранжевым

source: Try again!
es: ¡Inténtalo de nuevo!
ru: Попробуйте ещё раз!

# not_bad
source: Not bad for a start!
es: ¡No está mal para empezar!
ru: Неплохо для начала!

source: Excellent reaction!
es: ¡Excelente reacción!
ru: Отличная реакция!

source: Incredible speed!
es: ¡Velocidad increíble!
ru: Невероятная скорость!

# combo
source: COMBO x%d!
ru: КОМБО x%d!

# level_up
source: LEVEL %d!
es: ¡NIVEL %d!
ru: УРОВЕНЬ %d!

# excellent_points
source: Excellent! +%d points
es: ¡Excelente! +%d puntos
ru: Отлично! +%d очков

# game_over_title
source: Game Over
es: Juego Terminado
ru: Игра окончена

# game_over_score
source: Your score: %d
es: Tu puntuación: %d
ru: Ваш счет: %d

# game_over_memory_mode_result
source: Level: %d Score: %d You can be proud of your memory!
es: Nivel: %d Puntuación: %d ¡Puedes estar orgulloso de tu memoria!
ru: Уровень: %d Счет: %d Можете гордиться своей памятью!

# reaction_mode_results
source: 📊 Results: • Level: %d • Score: %d • Record: %d %@
es: 📊 Resultados: • Nivel: %d • Puntuación: %d • Récord: %d %@
ru: 📊 Результаты: • Уровень: %d • Счет: %d • Рекорд: %d %@

# game_over_completed
source: You completed all 15 levels of Switch! Your final score: %d
es: ¡Completaste los 15 niveles de Switch! Tu puntuación final: %d
ru: Вы прошли все 15 уровней игры Switch! Ваш итоговый счет: %d

# button_new_game
source: New Game
es: Nuevo Juego
ru: Новая игра

# button_play_again
source: Play Again
es: Jugar de Nuevo
ru: Играть снова

# button_main_menu
source: Main Menu
es: Menú Principal
ru: В главное меню

# button_show_instructions
source: Show Instructions
es: Mostrar Instrucciones
ru: Показать инструкции

# button_restart
source: Start Over
es: Empezar de Nuevo
ru: Начать заново

# remember_sequence_level
source: Remember the sequence! Level %d
es: ¡Recuerda la secuencia! Nivel %d
ru: Запомните последовательность! Уровень %d

# remember_pattern_level
source: Remember the pattern! Level %d
es: ¡Recuerda el patrón! Nivel %d
ru: Запомните паттерн! Уровень %d

# target_color
source: Target
es: Objetivo
ru: Цель

source: Your Color
es: Tu Color
ru: Ваш цвет

# launch_turn_on_sound
source: Turn on sound
es: Activar sonido
ru: Включите звук

source: Level 1
es: Nivel 1
ru: Уровень 1

source: Level 2
es: Nivel 2
ru: Уровень 2

source: Level 3
es: Nivel 3
ru: Уровень 3

source: Level 4
es: Nivel 4
ru: Уровень 4

source: Level 5
es: Nivel 5
ru: Уровень 5

source: Level 6
es: Nivel 6
ru: Уровень 6

source: Level 7
es: Nivel 7
ru: Уровень 7

source: Level 8
es: Nivel 8
ru: Уровень 8

source: Level 9
es: Nivel 9
ru: Уровень 9

source: Level 10
es: Nivel 10
ru: Уровень 10

source: Level 11
es: Nivel 11
ru: Уровень 11

source: Level 12
es: Nivel 12
ru: Уровень 12

source: Level 13
es: Nivel 13
ru: Уровень 13

source: Level 14
es: Nivel 14
ru: Уровень 14

source: Level 15
es: Nivel 15
ru: Уровень 15
